<?xml version="1.0"?>
<net name="Model39" version="11">
	<layers>
		<layer id="0" name="hidden_states" type="Parameter" version="opset1">
			<data shape="?,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="hidden_states">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_140110" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="0" size="40" />
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="14,9,hidden_states_1,input">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>2</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="self.proj.weight" type="Const" version="opset1">
			<data element_type="i8" shape="768, 3, 2, 16, 16" offset="40" size="1179648" />
			<output>
				<port id="0" precision="I8">
					<dim>768</dim>
					<dim>3</dim>
					<dim>2</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Convert_1299124" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="I8">
					<dim>768</dim>
					<dim>3</dim>
					<dim>2</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>768</dim>
					<dim>3</dim>
					<dim>2</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="self.proj.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="768, 1, 1, 1, 1" offset="1179688" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="self.proj.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>3</dim>
					<dim>2</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>768</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>768</dim>
					<dim>3</dim>
					<dim>2</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="self.proj.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>3</dim>
					<dim>2</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>3</dim>
					<dim>2</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="__module.proj/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="2, 16, 16" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>2</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>3</dim>
					<dim>2</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="__module.proj/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 768, 1, 1, 1" offset="1181224" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="__module.proj/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="33">
					<dim>-1</dim>
					<dim>768</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_140183" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="1184296" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="last_hidden_state">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Result_140211" type="Result" version="opset1" output_names="last_hidden_state">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1" />
		<edge from-layer="2" from-port="2" to-layer="8" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="4" to-port="0" />
		<edge from-layer="4" from-port="1" to-layer="6" to-port="0" />
		<edge from-layer="5" from-port="0" to-layer="6" to-port="1" />
		<edge from-layer="6" from-port="2" to-layer="7" to-port="0" />
		<edge from-layer="7" from-port="1" to-layer="8" to-port="1" />
		<edge from-layer="8" from-port="2" to-layer="10" to-port="0" />
		<edge from-layer="9" from-port="0" to-layer="10" to-port="1" />
		<edge from-layer="10" from-port="2" to-layer="12" to-port="0" />
		<edge from-layer="11" from-port="0" to-layer="12" to-port="1" />
		<edge from-layer="12" from-port="2" to-layer="13" to-port="0" />
	</edges>
	<rt_info>
		<info name="OpenVINO Runtime" value="2026.2.0-21903-52ddc073857-releases/2026/2" />
		<Runtime_version value="2026.2.0-21903-52ddc073857-releases/2026/2" />
		<conversion_parameters>
			<framework value="pytorch" />
			<is_python_object value="True" />
		</conversion_parameters>
		<nncf>
			<friendly_names_were_updated value="True" />
			<version value="3.2.0" />
			<weight_compression>
				<advanced_parameters value="{'statistics_path': None, 'lora_adapter_rank': 256, 'group_size_fallback_mode': 'error', 'min_adjusted_group_size': 32, 'awq_params': {'subset_size': 32, 'percent_to_apply': 0.002, 'alpha_min': 0.0, 'alpha_max': 1.0, 'steps': 100, 'prefer_data_aware_scaling': True}, 'scale_estimation_params': {'subset_size': 64, 'initial_steps': 5, 'scale_steps': 5, 'weight_penalty': -1.0}, 'gptq_params': {'damp_percent': 0.1, 'block_size': 128, 'subset_size': 128}, 'lora_correction_params': {'adapter_rank': 8, 'num_iterations': 3, 'apply_regularization': True, 'subset_size': 128, 'use_int8_adapters': True}, 'backend_params': {}, 'codebook': None, 'adaptive_codebook_params': {'value_type': 'f8e4m3', 'across_blocks': False, 'num_elements': 16}}" />
				<all_layers value="False" />
				<awq value="False" />
				<backup_mode value="int8_asym" />
				<compression_format value="dequantize" />
				<gptq value="False" />
				<group_size value="-1" />
				<ignored_scope value="[]" />
				<lora_correction value="False" />
				<mode value="int8_sym" />
				<ratio value="1.0" />
				<scale_estimation value="False" />
				<sensitivity_metric value="weight_quantization_error" />
			</weight_compression>
		</nncf>
		<optimum>
			<nncf_version value="3.2.0" />
			<optimum_intel_version value="2.0.0" />
			<optimum_version value="2.2.0" />
			<pytorch_version value="2.12.0+cpu" />
			<transformers_version value="5.11.0" />
		</optimum>
	</rt_info>
</net>
