<?xml version="1.0"?>
<net name="Model42" version="11">
	<layers>
		<layer id="0" name="hidden_states" type="Parameter" version="opset1">
			<data shape="?,768" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="hidden_states">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="attention_mask" type="Parameter" version="opset1">
			<data shape="1,?,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="attention_mask">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="rotary_pos_emb" type="Parameter" version="opset1">
			<data shape="?,32" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="rotary_pos_emb">
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="__module.blocks.0.norm1/aten::layer_norm/Multiply" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="0" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="__module.blocks.0.norm1/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999999747524271e-07" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_173818" type="Const" version="opset1">
			<data element_type="f32" shape="1, 768" offset="4" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="__module.blocks.0.norm1/aten::layer_norm/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_173819" type="Const" version="opset1">
			<data element_type="f32" shape="1, 768" offset="3076" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="__module.blocks.0.norm1/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="72,hidden_states.3">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="self.blocks.0.attn.qkv.weight" type="Const" version="opset1">
			<data element_type="i8" shape="2304, 768" offset="6148" size="1769472" />
			<output>
				<port id="0" precision="I8">
					<dim>2304</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Convert_1438513" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="I8">
					<dim>2304</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>2304</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="self.blocks.0.attn.qkv.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="2304, 1" offset="1775620" size="4608" />
			<output>
				<port id="0" precision="FP16">
					<dim>2304</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="self.blocks.0.attn.qkv.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>2304</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>2304</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2304</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="__module.blocks.0.attn.qkv/ov_ext::linear/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2304</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2304</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="__module.blocks.0.attn.qkv/ov_ext::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2304</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="self.blocks.0.attn.qkv.bias" type="Const" version="opset1">
			<data element_type="bf16" shape="2304" offset="1780228" size="4608" />
			<output>
				<port id="0" precision="BF16" names="self.blocks.0.attn.qkv.bias">
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="__module.blocks.0.attn.qkv/ov_ext::linear/Convert_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="BF16">
					<dim>2304</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="__module.blocks.0.attn.qkv/ov_ext::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2304</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2304</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="78">
					<dim>-1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_175123" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1784836" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="__module.blocks.0.attn/aten::reshape/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2304</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="80">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_142655" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1784868" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="__module.blocks.0.attn/aten::permute/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="82">
					<dim>3</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="49" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1784900" size="8" />
			<output>
				<port id="0" precision="I64" names="49" />
			</output>
		</layer>
		<layer id="23" name="__module.blocks.0.attn/prim::ListUnpack/Split" type="Split" version="opset1">
			<data num_splits="3" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="__module.blocks.0.attn/prim::ListUnpack/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="84,87,q.1,q.3">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="aten::cat/Concat" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="31,emb">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="aten::cos/Cos" type="Cos" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="32,cos.1">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="58" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1784908" size="8" />
			<output>
				<port id="0" precision="I64" names="58" />
			</output>
		</layer>
		<layer id="28" name="__module.blocks.0.attn/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="1016,1119,1222,192,295,398,501,604,707,810,89,913,cos,cos.11,cos.13,cos.15,cos.17,cos.19,cos.21,cos.23,cos.3,cos.5,cos.7,cos.9">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="__module.blocks.0.attn/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="91">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="__module.blocks.0.attn/aten::size/ShapeOf_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="54" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1784916" size="8" />
			<output>
				<port id="0" precision="I64" names="54" />
			</output>
		</layer>
		<layer id="32" name="__module.blocks.0.attn/aten::size/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="1784924" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="33" name="__module.blocks.0.attn/aten::size/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="1019,1024,1035,1040,108,1122,1127,113,1138,1143,1225,1230,1241,1246,195,200,211,216,298,303,314,319,401,406,417,422,504,509,520,525,607,612,623,628,710,715,726,731,813,818,829,834,916,92,921,932,937,97" />
			</output>
		</layer>
		<layer id="34" name="Constant_142593" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1784916" size="8" />
			<output>
				<port id="0" precision="I64" names="59" />
			</output>
		</layer>
		<layer id="35" name="__module.blocks.0.attn/aten::floor_divide/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" />
			</output>
		</layer>
		<layer id="36" name="__module.blocks.0.attn/aten::floor_divide/Floor" type="Floor" version="opset1">
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="100,1021,1022,1026,1027,1037,1038,1042,1043,110,111,1124,1125,1129,1130,1140,1141,1145,1146,115,116,1227,1228,1232,1233,1243,1244,1248,1249,197,198,202,203,213,214,218,219,300,301,305,306,316,317,321,322,403,404,408,409,419,420,424,425,506,507,511,512,522,523,527,528,609,610,614,615,625,626,630,631,712,713,717,718,728,729,733,734,815,816,820,821,831,832,836,837,918,919,923,924,934,935,939,94,940,95,99" />
			</output>
		</layer>
		<layer id="37" name="Constant_161691" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1784928" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="__module.blocks.0.attn/aten::slice/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_142816" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1784936" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_142818" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1784944" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_142775" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1784916" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="__module.blocks.0.attn/aten::slice/Slice" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="101,x2.1">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="__module.blocks.0.attn/aten::neg/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="44" name="__module.blocks.0.attn/aten::neg/ConvertLike" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I32" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="45" name="__module.blocks.0.attn/aten::neg/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="102">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_142683" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1784900" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_142724" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1784944" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_142681" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1784916" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="__module.blocks.0.attn/aten::slice/Slice_1" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="96,x1.1">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="__module.blocks.0.attn/aten::cat/Concat" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="104">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="aten::sin/Sin" type="Sin" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="33,sin.1">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="__module.blocks.0.attn/aten::unsqueeze/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="1017,1120,1223,193,296,399,502,605,708,811,90,914,sin,sin.11,sin.13,sin.15,sin.17,sin.19,sin.21,sin.23,sin.3,sin.5,sin.7,sin.9">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="__module.blocks.0.attn/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="105">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="__module.blocks.0.attn/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="106,123,q.5,q_embed.1">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="__module.blocks.0.attn/aten::transpose/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="1784952" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="__module.blocks.0.attn/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="125,q.7">
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="__module.blocks.0.attn/prim::ListUnpack/Squeeze_0" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="85,88,k.1,k.3">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="__module.blocks.0.attn/aten::mul/Multiply_2" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="107">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_143024" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1784936" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_143026" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1784944" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_142983" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1784916" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="__module.blocks.0.attn/aten::slice/Slice_2" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="117,x2.3">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="__module.blocks.0.attn/aten::neg/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="64" name="__module.blocks.0.attn/aten::neg/ConvertLike_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I32" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="65" name="__module.blocks.0.attn/aten::neg/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="118">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_142891" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1784900" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_142932" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1784944" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Constant_142889" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1784916" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="__module.blocks.0.attn/aten::slice/Slice_3" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="112,x1.3">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="__module.blocks.0.attn/aten::cat/Concat_1" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="120">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="__module.blocks.0.attn/aten::mul/Multiply_3" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="121">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="__module.blocks.0.attn/aten::add/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="122,124,k.5,k_embed.1">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="__module.blocks.0.attn/aten::transpose/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="1784952" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="__module.blocks.0.attn/aten::transpose/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="126,k.7">
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="__module.blocks.0.attn/prim::ListUnpack/Squeeze_1" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="86,v.1">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="__module.blocks.0.attn/aten::transpose/Constant_2" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="1784952" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="__module.blocks.0.attn/aten::transpose/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="127,v.3">
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="__module.blocks.0.attn/aten::scaled_dot_product_attention/ScaledDotProductAttention" type="ScaledDotProductAttention" version="opset13">
			<data causal="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="128,attn_output.1">
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="__module.blocks.0.attn/aten::transpose/Constant_3" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="1784952" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="__module.blocks.0.attn/aten::transpose/Transpose_3" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="129,attn_output.3">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_175124" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="1784964" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="__module.blocks.0.attn/aten::reshape/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="131">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="self.blocks.0.attn.proj.weight" type="Const" version="opset1">
			<data element_type="i8" shape="768, 768" offset="1784980" size="589824" />
			<output>
				<port id="0" precision="I8">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Convert_1500457" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="I8">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="self.blocks.0.attn.proj.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="768, 1" offset="2374804" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="self.blocks.0.attn.proj.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="__module.blocks.0.attn.proj/ov_ext::linear/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="__module.blocks.0.attn.proj/ov_ext::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="self.blocks.0.attn.proj.bias" type="Const" version="opset1">
			<data element_type="bf16" shape="768" offset="2376340" size="1536" />
			<output>
				<port id="0" precision="BF16" names="self.blocks.0.attn.proj.bias">
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="__module.blocks.0.attn.proj/ov_ext::linear/Convert_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="BF16">
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="__module.blocks.0.attn.proj/ov_ext::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="134">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="__module.blocks.0/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="135,input.1">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="__module.blocks.0.norm2/aten::layer_norm/Multiply" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="0" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="__module.blocks.0.norm2/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999999747524271e-07" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_173820" type="Const" version="opset1">
			<data element_type="f32" shape="1, 768" offset="2377876" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="__module.blocks.0.norm2/aten::layer_norm/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_173821" type="Const" version="opset1">
			<data element_type="f32" shape="1, 768" offset="2380948" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="__module.blocks.0.norm2/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="139">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="self.blocks.0.mlp.linear_fc1.weight" type="Const" version="opset1">
			<data element_type="i8" shape="3072, 768" offset="2384020" size="2359296" />
			<output>
				<port id="0" precision="I8">
					<dim>3072</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Convert_1314625" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="I8">
					<dim>3072</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>3072</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="self.blocks.0.mlp.linear_fc1.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="3072, 1" offset="4743316" size="6144" />
			<output>
				<port id="0" precision="FP16">
					<dim>3072</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="self.blocks.0.mlp.linear_fc1.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>3072</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>3072</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>3072</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="__module.blocks.0.mlp.linear_fc1/ov_ext::linear/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>3072</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>3072</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="__module.blocks.0.mlp.linear_fc1/ov_ext::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>3072</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="self.blocks.0.mlp.linear_fc1.bias" type="Const" version="opset1">
			<data element_type="bf16" shape="3072" offset="4749460" size="6144" />
			<output>
				<port id="0" precision="BF16" names="self.blocks.0.mlp.linear_fc1.bias">
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="__module.blocks.0.mlp.linear_fc1/ov_ext::linear/Convert_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="BF16">
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="__module.blocks.0.mlp.linear_fc1/ov_ext::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="145,input.3">
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="__module.blocks.0.mlp.act_fn/aten::gelu/Gelu" type="Gelu" version="opset7">
			<data approximation_mode="TANH" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="146">
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="self.blocks.0.mlp.linear_fc2.weight" type="Const" version="opset1">
			<data element_type="i8" shape="768, 3072" offset="4755604" size="2359296" />
			<output>
				<port id="0" precision="I8">
					<dim>768</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Convert_1319787" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="I8">
					<dim>768</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>768</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="self.blocks.0.mlp.linear_fc2.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="768, 1" offset="7114900" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="self.blocks.0.mlp.linear_fc2.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>768</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="__module.blocks.0.mlp.linear_fc2/ov_ext::linear/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="__module.blocks.0.mlp.linear_fc2/ov_ext::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="self.blocks.0.mlp.linear_fc2.bias" type="Const" version="opset1">
			<data element_type="bf16" shape="768" offset="7116436" size="1536" />
			<output>
				<port id="0" precision="BF16" names="self.blocks.0.mlp.linear_fc2.bias">
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="__module.blocks.0.mlp.linear_fc2/ov_ext::linear/Convert_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="BF16">
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="__module.blocks.0.mlp.linear_fc2/ov_ext::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="149">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="__module.blocks.0/aten::add/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="150,input.5">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="__module.blocks.1.norm1/aten::layer_norm/Multiply" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="0" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="__module.blocks.1.norm1/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999999747524271e-07" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Constant_173822" type="Const" version="opset1">
			<data element_type="f32" shape="1, 768" offset="7117972" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="__module.blocks.1.norm1/aten::layer_norm/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Constant_173823" type="Const" version="opset1">
			<data element_type="f32" shape="1, 768" offset="7121044" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="__module.blocks.1.norm1/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="175,hidden_states.5">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="self.blocks.1.attn.qkv.weight" type="Const" version="opset1">
			<data element_type="i8" shape="2304, 768" offset="7124116" size="1769472" />
			<output>
				<port id="0" precision="I8">
					<dim>2304</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Convert_1443675" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="I8">
					<dim>2304</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>2304</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="self.blocks.1.attn.qkv.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="2304, 1" offset="8893588" size="4608" />
			<output>
				<port id="0" precision="FP16">
					<dim>2304</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="self.blocks.1.attn.qkv.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>2304</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>2304</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2304</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="__module.blocks.1.attn.qkv/ov_ext::linear/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2304</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2304</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="__module.blocks.1.attn.qkv/ov_ext::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2304</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
